Revit 2027 API
Application.NewPointOnEdge Method
Create a PointOnEdge object which is used to define the placement of a ReferencePoint.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointOnEdge NewPointOnEdge(
	Reference edgeReference,
	PointLocationOnCurve locationOnCurve
)
Public Function NewPointOnEdge (
	edgeReference As Reference,
	locationOnCurve As PointLocationOnCurve
) As PointOnEdge
public:
PointOnEdge^ NewPointOnEdge(
	Reference^ edgeReference,
	PointLocationOnCurve^ locationOnCurve
)
member NewPointOnEdge :
        edgeReference : Reference *
        locationOnCurve : PointLocationOnCurve -> PointOnEdge
Parameters
edgeReference Reference
The reference whose edge the object will be created on.
locationOnCurve PointLocationOnCurve
The location on the edge.
Return Value
PointOnEdge
If creation was successful then a new object is returned, otherwise an exception with failure information will be thrown.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument edgeReference or locationOnCurve is null.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace